socialNetwork/wrk2/outs/c10_r500.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.958ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 3.699ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.46ms    3.40ms  15.03ms   93.84%
    Req/Sec   258.45    137.29   615.00     70.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.60ms
 75.000%    3.71ms
 90.000%    5.60ms
 99.000%   15.03ms
 99.900%   42.94ms
 99.990%   99.65ms
 99.999%  109.50ms
100.000%  109.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.728     0.000000            1         1.00
       1.827     0.100000         2503         1.11
       2.007     0.200000         5010         1.25
       2.165     0.300000         7487         1.43
       2.355     0.400000        10003         1.67
       2.603     0.500000        12487         2.00
       2.751     0.550000        13728         2.22
       2.925     0.600000        14976         2.50
       3.129     0.650000        16227         2.86
       3.379     0.700000        17477         3.33
       3.707     0.750000        18727         4.00
       3.897     0.775000        19343         4.44
       4.127     0.800000        19977         5.00
       4.379     0.825000        20591         5.71
       4.699     0.850000        21215         6.67
       5.079     0.875000        21838         8.00
       5.323     0.887500        22153         8.89
       5.599     0.900000        22462        10.00
       5.955     0.912500        22774        11.43
       6.367     0.925000        23087        13.33
       6.843     0.937500        23399        16.00
       7.135     0.943750        23554        17.78
       7.455     0.950000        23709        20.00
       7.855     0.956250        23865        22.86
       8.343     0.962500        24024        26.67
       8.951     0.968750        24177        32.00
       9.431     0.971875        24255        35.56
      10.007     0.975000        24335        40.00
      10.575     0.978125        24412        45.71
      11.223     0.981250        24489        53.33
      12.303     0.984375        24568        64.00
      12.791     0.985938        24607        71.11
      13.711     0.987500        24645        80.00
      14.479     0.989062        24684        91.43
      15.591     0.990625        24723       106.67
      16.975     0.992188        24762       128.00
      18.191     0.992969        24781       142.22
      19.023     0.993750        24801       160.00
      21.071     0.994531        24820       182.86
      22.687     0.995313        24840       213.33
      25.087     0.996094        24859       256.00
      26.687     0.996484        24869       284.44
      27.935     0.996875        24879       320.00
      28.735     0.997266        24888       365.71
      30.703     0.997656        24898       426.67
      32.991     0.998047        24908       512.00
      35.647     0.998242        24913       568.89
      36.735     0.998437        24918       640.00
      37.599     0.998633        24922       731.43
      40.767     0.998828        24927       853.33
      44.031     0.999023        24932      1024.00
      44.735     0.999121        24935      1137.78
      45.951     0.999219        24937      1280.00
      47.327     0.999316        24939      1462.86
      54.463     0.999414        24942      1706.67
      58.015     0.999512        24944      2048.00
      63.295     0.999561        24946      2275.56
      76.223     0.999609        24947      2560.00
      79.551     0.999658        24948      2925.71
      81.151     0.999707        24949      3413.33
      81.599     0.999756        24950      4096.00
      83.711     0.999780        24951      4551.11
      87.039     0.999805        24952      5120.00
      87.039     0.999829        24952      5851.43
      89.087     0.999854        24953      6826.67
      89.087     0.999878        24953      8192.00
      99.647     0.999890        24954      9102.22
      99.647     0.999902        24954     10240.00
      99.647     0.999915        24954     11702.86
     100.863     0.999927        24955     13653.33
     100.863     0.999939        24955     16384.00
     100.863     0.999945        24955     18204.44
     100.863     0.999951        24955     20480.00
     100.863     0.999957        24955     23405.71
     109.503     0.999963        24956     27306.67
     109.503     1.000000        24956          inf
#[Mean    =        3.460, StdDeviation   =        3.404]
#[Max     =      109.440, Total count    =        24956]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29937 requests in 1.00m, 7.38MB read
  Non-2xx or 3xx responses: 29937
Requests/sec:    498.95
Transfer/sec:    125.98KB