socialNetwork/wrk2/outs/c300_r10.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 300 connections
  Thread calibration: mean lat.: 3.265ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.750ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.56ms    1.76ms  11.85ms   90.98%
    Req/Sec     5.48     24.05   111.00     94.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.03ms
 75.000%    3.52ms
 90.000%    4.95ms
 99.000%   11.85ms
 99.900%   12.62ms
 99.990%   13.65ms
 99.999%   13.65ms
100.000%   13.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.035     0.000000            1         1.00
       2.495     0.100000           53         1.11
       2.653     0.200000          105         1.25
       2.773     0.300000          158         1.43
       2.889     0.400000          209         1.67
       3.025     0.500000          263         2.00
       3.105     0.550000          287         2.22
       3.205     0.600000          315         2.50
       3.277     0.650000          340         2.86
       3.379     0.700000          366         3.33
       3.523     0.750000          393         4.00
       3.641     0.775000          404         4.44
       3.767     0.800000          417         5.00
       3.881     0.825000          430         5.71
       4.179     0.850000          443         6.67
       4.467     0.875000          456         8.00
       4.555     0.887500          463         8.89
       4.955     0.900000          469        10.00
       5.571     0.912500          476        11.43
       6.495     0.925000          482        13.33
       6.719     0.937500          489        16.00
       6.895     0.943750          492        17.78
       7.147     0.950000          495        20.00
       7.859     0.956250          499        22.86
       8.359     0.962500          502        26.67
       8.887     0.968750          505        32.00
       9.023     0.971875          508        35.56
       9.023     0.975000          508        40.00
       9.815     0.978125          510        45.71
      11.151     0.981250          512        53.33
      11.487     0.984375          513        64.00
      11.647     0.985938          515        71.11
      11.647     0.987500          515        80.00
      11.855     0.989062          516        91.43
      12.287     0.990625          517       106.67
      12.287     0.992188          517       128.00
      12.311     0.992969          518       142.22
      12.311     0.993750          518       160.00
      12.383     0.994531          519       182.86
      12.383     0.995313          519       213.33
      12.383     0.996094          519       256.00
      12.623     0.996484          520       284.44
      12.623     0.996875          520       320.00
      12.623     0.997266          520       365.71
      12.623     0.997656          520       426.67
      12.623     0.998047          520       512.00
      13.655     0.998242          521       568.89
      13.655     1.000000          521          inf
#[Mean    =        3.563, StdDeviation   =        1.763]
#[Max     =       13.648, Total count    =          521]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  633 requests in 1.00m, 159.66KB read
  Socket errors: connect 0, read 0, write 0, timeout 8238
  Non-2xx or 3xx responses: 633
Requests/sec:     10.51
Transfer/sec:      2.65KB