socialNetwork/wrk2/outs/c300_r1000.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 300 connections
  Thread calibration: mean lat.: 16.794ms, rate sampling interval: 87ms
  Thread calibration: mean lat.: 15.594ms, rate sampling interval: 77ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.87s     8.65s   28.48s    57.66%
    Req/Sec   517.33    481.31     1.32k    35.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.34s 
 75.000%   21.46s 
 90.000%   25.36s 
 99.000%   28.48s 
 99.900%   34.21s 
 99.990%   37.16s 
 99.999%   37.49s 
100.000%   37.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.049     0.000000            1         1.00
     757.759     0.100000         5117         1.11
    4788.223     0.200000        10238         1.25
    8208.383     0.300000        15355         1.43
   11345.919     0.400000        20472         1.67
   14344.191     0.500000        25589         2.00
   15769.599     0.550000        28150         2.22
   17170.431     0.600000        30711         2.50
   18546.687     0.650000        33280         2.86
   20054.015     0.700000        35825         3.33
   21463.039     0.750000        38384         4.00
   22151.167     0.775000        39680         4.44
   22855.679     0.800000        40967         5.00
   23478.271     0.825000        42229         5.71
   24117.247     0.850000        43502         6.67
   24772.607     0.875000        44796         8.00
   25083.903     0.887500        45435         8.89
   25362.431     0.900000        46078        10.00
   25640.959     0.912500        46700        11.43
   25886.719     0.925000        47335        13.33
   26132.479     0.937500        48014        16.00
   26247.167     0.943750        48329        17.78
   26361.855     0.950000        48610        20.00
   26476.543     0.956250        48957        22.86
   26607.615     0.962500        49305        26.67
   26755.071     0.968750        49588        32.00
   26869.759     0.971875        49755        35.56
   27017.215     0.975000        49899        40.00
   27164.671     0.978125        50064        45.71
   27328.511     0.981250        50218        53.33
   27607.039     0.984375        50371        64.00
   27770.879     0.985938        50448        71.11
   28033.023     0.987500        50531        80.00
   28295.167     0.989062        50612        91.43
   28590.079     0.990625        50688       106.67
   28950.527     0.992188        50769       128.00
   29245.439     0.992969        50808       142.22
   29523.967     0.993750        50848       160.00
   29769.727     0.994531        50890       182.86
   30097.407     0.995313        50930       213.33
   30703.615     0.996094        50968       256.00
   31227.903     0.996484        50988       284.44
   32030.719     0.996875        51008       320.00
   32899.071     0.997266        51028       365.71
   33357.823     0.997656        51049       426.67
   33554.431     0.998047        51068       512.00
   33652.735     0.998242        51080       568.89
   33882.111     0.998437        51091       640.00
   34013.183     0.998633        51098       731.43
   34144.255     0.998828        51109       853.33
   34308.095     0.999023        51120      1024.00
   34406.399     0.999121        51123      1137.78
   34504.703     0.999219        51128      1280.00
   34668.543     0.999316        51135      1462.86
   35160.063     0.999414        51138      1706.67
   36208.639     0.999512        51143      2048.00
   36274.175     0.999561        51145      2275.56
   36536.319     0.999609        51150      2560.00
   36536.319     0.999658        51150      2925.71
   36667.391     0.999707        51153      3413.33
   36831.231     0.999756        51155      4096.00
   36863.999     0.999780        51157      4551.11
   36896.767     0.999805        51158      5120.00
   36929.535     0.999829        51160      5851.43
   36929.535     0.999854        51160      6826.67
   36962.303     0.999878        51161      8192.00
   37158.911     0.999890        51162      9102.22
   37224.447     0.999902        51163     10240.00
   37224.447     0.999915        51163     11702.86
   37355.519     0.999927        51164     13653.33
   37355.519     0.999939        51164     16384.00
   37486.591     0.999945        51166     18204.44
   37486.591     0.999951        51166     20480.00
   37486.591     0.999957        51166     23405.71
   37486.591     0.999963        51166     27306.67
   37486.591     0.999969        51166     32768.00
   37486.591     0.999973        51166     36408.89
   37486.591     0.999976        51166     40960.00
   37486.591     0.999979        51166     46811.43
   37519.359     0.999982        51167     54613.33
   37519.359     1.000000        51167          inf
#[Mean    =    13874.137, StdDeviation   =     8650.847]
#[Max     =    37486.592, Total count    =        51167]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  56682 requests in 1.00m, 14.01MB read
  Socket errors: connect 0, read 0, write 0, timeout 13
  Non-2xx or 3xx responses: 56682
Requests/sec:    944.82
Transfer/sec:    239.11KB